app/controllers/houses_controller.rb

  def create
    @house = House.new(house_params)
    if @house.save
---
INSERT INTO "houses" ("name", "source", "author", "motto") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Ravenclaw"], ["source", "Harry Potter and the Sorcerer's Stone"], ["author", "JK Rowling"], ["motto", "Wit beyond measure is man's greatest treasure"]]