app/controllers/members_controller.rb

INSERT INTO "members" ("first_name", "last_name", "house_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["first_name", "Edmure"], ["last_name", "Tully"], ["house_id", 25], ["created_at", "2019-09-05 19:05:26.709701"], ["updated_at", "2019-09-05 19:05:26.709701"]]
---
  def create
    @member = Member.new(member_params)
    @house = House.find(params[:house_id])
    @member.house = @house
    if @member.save